### Find maximum and minimum records of inner, left, right and full outer join ###

In [1]:
%CREATE potato.db

In [24]:
CREATE TABLE t1 (
  id int
);

In [37]:
INSERT INTO t1 VALUES 
(1),
(1),
(1),
(1),
(1);

In [38]:
select * from t1

+----+
| id |
+----+
| 1  |
+----+
| 1  |
+----+
| 1  |
+----+
| 1  |
+----+
| 1  |
+----+

In [39]:
select count(*) from t1

+----------+
| count(*) |
+----------+
| 5        |
+----------+

In [28]:
CREATE TABLE t2 (
  id int
);

In [33]:
INSERT INTO t2 VALUES 
(1),
(1),
(1),
(1),
(1),
(1),
(1),
(1),
(1),
(1);

In [34]:
select * from t2

+----+
| id |
+----+
| 1  |
+----+
| 1  |
+----+
| 1  |
+----+
| 1  |
+----+
| 1  |
+----+
| 1  |
+----+
| 1  |
+----+
| 1  |
+----+
| 1  |
+----+
| 1  |
+----+

select count(*) from t2

# maximum records

In [41]:
select count(*) from t1 a
inner join t2 b on
a.id = b.id

+----------+
| count(*) |
+----------+
| 50       |
+----------+

In [42]:
select count(*) from t1 a
left join t2 b on
a.id = b.id

+----------+
| count(*) |
+----------+
| 50       |
+----------+

In [43]:
select count(*) from t1 a
right join t2 b on
a.id = b.id

Error: RIGHT and FULL OUTER JOINs are not currently supported

count(*)
50

In [44]:
select count(*) from t1 a
full outer join t2 b on
a.id = b.id

Error: RIGHT and FULL OUTER JOINs are not currently supported

count(*)
50

# Minimum records

In [45]:
CREATE TABLE t3 (
  id int
);

In [50]:
INSERT INTO t3 VALUES 
(2),
(2),
(2),
(2),
(2);

In [51]:
select * from t3

+----+
| id |
+----+
| 2  |
+----+
| 2  |
+----+
| 2  |
+----+
| 2  |
+----+
| 2  |
+----+
| 2  |
+----+
| 2  |
+----+
| 2  |
+----+
| 2  |
+----+
| 2  |
+----+

In [52]:
select count(*) from t3

+----------+
| count(*) |
+----------+
| 10       |
+----------+

In [53]:
select count(*) from t1 a
inner join t3 b on
a.id = b.id

+----------+
| count(*) |
+----------+
| 0        |
+----------+

In [54]:
select count(*) from t1 a
left join t3 b on
a.id = b.id

+----------+
| count(*) |
+----------+
| 5        |
+----------+

In [ ]:
select count(*) from t1 a
right join t3 b on
a.id = b.id

count(*)
10

In [ ]:
select count(*) from t1 a
full outer join t3 b on
a.id = b.id

count(*)
15